performance_test/load-test.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up to 100"
    - duration: 240
      arrivalRate: 100
      name: "Constant 100"
  variables:
    get_productId:
      - "10000000"
      - "9340283"
      - "9000000"
      - "8239485"
      - "8000000"
      - "7849245"
      - "7000000"
      - "6483919"
      - "6000000"
      - "5329432"
      - "5000000"
      - "4329491"
      - "4000000"
      - "3653284"
      - "3000000"
      - "2453859"
      - "2000000"
      - "1452859"
      - "1000000"
      - "48296"
    post_productId:
      - "10000000"
      - "9000000"
      - "8000000"
      - "7000000"
      - "6000000"
      - "5000000"
      - "4000000"
      - "3000000"
      - "2000000"
      - "1000000"
    price:
      - "9.99"
      - "19.99"
      - "29.99"
      - "39.99"
      - "49.99"
      - "59.99"
      - "99.99"
    tax:
      - "0.5"
      - "1"
      - "1.5"
      - "2"
      - "2.5"
      - "3"
      - "5"
    seller:
      - "Normal John"
      - "Sherman"
      - "Brendon"
      - "Chandler"
      - "Elwin"
      - "Buddy"
scenarios:
  - name: "GET route"
    flow:
      - get:
          url: "/api/product/quotes?productId={{get_productId}}"
  - name: "POST route"
    flow:
      - post:
          url: "/api/product/prices"
          json:
            productId: "{{post_productId}}"
            seller: "{{seller}}"
            price: "{{price}}"
            tax: "{{tax}}"